{
  "backend/main.mo": "Actor that includes the blob storage mixin for basic storage functionality.",
  "feature_evidence.json": "Feature evidence report listing two Valentine‑related features, their affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for major frontend files and components used in the Valentine experience.",
  "frontend/index.css": "Tailwind‑based global stylesheet defining color variables, dark mode variants, and base styling rules.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx with a default Valentine‑themed title.",
  "frontend/src/App.tsx": "Main React app handling routing, personalization, the Valentine card flow, celebration animations, and CTA visibility.",
  "frontend/src/components/AdminToolLinkCopyControl.tsx": "Admin‑only UI button that copies a special tool access link when an admin token is present in the URL hash.",
  "frontend/src/components/CelebrationHearts.tsx": "Generates 30 rising heart animations that auto‑clear after completion.",
  "frontend/src/components/Fireworks.tsx": "Placeholder component file with no implementation.",
  "frontend/src/components/FloatingHearts.tsx": "Creates 20 continuously floating hearts with varied opacity, timing, and size.",
  "frontend/src/components/MakeYourOwnCTA.tsx": "Fixed-position CTA button that navigates users to the wishlink tool page.",
  "frontend/src/components/SmilingEmojiAnimation.tsx": "Displays bouncing smiling emojis when triggered, clearing them after the animation ends.",
  "frontend/src/components/UpwardSmileAnimation.tsx": "Renders upward‑rising smiling emojis with random timing and positions when the celebration effect is triggered.",
  "frontend/src/components/ValentineCard.tsx": "Interactive Valentine card component with moving 'No' button, yes-response animation, and personalized recipient handling.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity authentication and refreshes dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, stored identities, and AuthClient lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing because no backend queries are needed.",
  "frontend/src/index.css": "Tailwind CSS setup with custom color variables and animations for hearts, glow, scale, and other UI effects.",
  "frontend/src/main.tsx": "Entrypoint that initializes React, wraps the app with QueryClient and InternetIdentity providers, and loads global styles.",
  "frontend/src/pages/WishlinkToolPage.tsx": "Page for generating personalized Valentine share links with copy-to-clipboard features and a themed UI.",
  "frontend/src/utils/personalization.ts": "Utility functions for normalizing recipient names, parsing them from URLs, and generating shareable personalized links.",
  "frontend/src/utils/routing.ts": "Utilities for detecting tool routes in URL variations and navigating between the tool page and the main Valentine experience.",
  "frontend/tailwind.config.js": "TailwindCSS configuration extending colors, animations, and container settings with OKLCH variables and plugins.",
  "project_state.json": "Project metadata describing architecture, known issues, features, and build/deployment context for the Valentine SPA."
}